Revit 2027 API
ExportDWGSettings.Create(Document, String) Method
 Create a DWG export settings with default values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExportDWGSettings Create(
	Document document,
	string name
)
Public Shared Function Create (
	document As Document,
	name As String
) As ExportDWGSettings
public:
static ExportDWGSettings^ Create(
	Document^ document,
	String^ name
)
static member Create :
        document : Document *
        name : string -> ExportDWGSettings
Parameters
document Document
 Document where created settings is saved.
name String
 The name specified to this settings.
Return Value
ExportDWGSettings
 The new DWG export settings instance.
Exceptions
Exception | Condition
ArgumentException |  ExistOrEmpty
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportDWGSettings Class
Create Overload
Autodesk.Revit.DB Namespace